CREATE TABLE UPJONG_CODE(
	INDSLCLSCD char(1) not null,     /* 상권정보 업종 대분류 코드 */
	INDSLCLSNM varchar(20) not null, /* 상권정보 업종 대분류 코드명 */
	INDSMCLSCD varchar(10) not null, /* 상권정보 업종 중분류 코드 */
	INDSMCLSNM varchar(20) not null, /* 상권정보 업종 중분류 코드명 */
	INDSSCLSCD varchar(10) not null, /* 상권정보 업종 소분류 코드명 */
	INDSSCLSNM varchar(20) not null /* 상권정보 업종 소분류 코드명 */
);

SELECT * FROM UPJONG_CODE;

/* 카피 페이지에 없는 정보 삭제 */
DELETE FROM UPJONG_CODE WHERE INDSLCLSCD = 'Q' AND INDSSCLSNM NOT IN ('한식/백반/한정식','커피전문점/카페/다방','후라이드/양념치킨','갈비/삼겹살','호프/맥주',
	'라면김밥분식','중국음식/중국집','횟집','제과점','국수/만두/칼국수','해장국/감자탕','소주방/포장마차','족발/보쌈전문','피자전문','떡/한과집','떡볶이전문','정통양식/경양식','기타일반유흥주점','음식점-일식',
    '순대전문','곱창/양구이전문','꼬치구이전문점','돈가스전문','부대찌개/섞어찌개','찐빵전문','낙지/오징어','음식점-초밥전문','룸살롱/단란주점','햄버거전문','곰장어전문','추어탕전문','닭갈비전문',
    '냉면전문','설렁탕전문','매운탕전문','닭내장/닭발요리','아구전문','참치전문','삼계탕전문','찜닭전문','죽전문','오리고기전문','도시락전문','동남아음식전문점','샌드위치전문','토스트전문',
    '민속주점','샤브샤브전문','해물찜/탕전문','파전전문','두부요리전문','스파게티전문','우동전문','바닷가재/게요리전문','사철탕전문','도너츠전문','로바다야끼','갈치/생선구이','보리밥전문',
    '빠/카페/스탠드빠','쌈밥전문','조개구이전문','바베큐전문','순두부전문','기사식당','복전문','종합부페','홍어전문','한정식전문','기타고기요리','나이트클럽','게장전문','고기부페','고등어전문',
    '관광/유흥주점','구내식당/자급식음식점','국/찌개배달','굴요리전문','기타전문서양음식점','닭도리탕전문','돌구이요리전문','돌솥/비빕밥전문점','떡전문','무도유흥주점-종합','민물장어전문',
    '버섯전문','보드게임카페','불닭전문','사주카페','생과일주스전문','생과자점','수산물전문음식점-종합','스낵','스테이크전문','애견카페','야식집','옻닭전문','음식출장조달','재첩국전문',
    '전통찻집/인삼찻집','철판구이요리전문','카레전문','케익전문점','탕수육전문','토종닭전문','패밀리레스토랑','퓨전음식전문','한국식유흥주점','한식부페','핫도그','황태전문');

DELETE FROM UPJONG_CODE WHERE INDSLCLSNM = '소매' AND INDSSCLSNM NOT IN ('편의점','수퍼마켓','옷가게','약국','정육점','식료품점','꽃집/꽃배달','청과물소매','화장품판매점','철물/건설자재소매',
	'잡화점','안경업','석유판매업','일반의류','사무/문구용품','수산물소매','아이스크림판매','시계/귀금속','건강식품판매','일반가구소매','철물점','건강/헬스용품','액세서리판매','침구/수예품','컴퓨터판매점',
    '주방용품','서적/신문소매','휴대폰가게','의료용품소매','신발소매','인삼제품판매','보일러/냉난방용품','자전거판매','유아/임부복','공예품판매','낚시용품판매','섬유/직물/주단','일반가전제품','골프용품판매','차량가스충전소',
    '한복/갈옷/민속옷','완구점','재활용/고물수집','가방/가죽제품소매','캐쥬얼/스포츠의류','생활용품판매','악기판매','교복판매','인테리어/욕실용품/커튼','보청기판매','구두제화/캐주얼화','유기농식품판매',
    '스키장비판매','LPG판매','가구판매-돌침대','가구판매-사무용가구','가구판매-수입가구','가구판매-침대전문','가발판매','가스레인지판매','가정용연료소매','가죽/모피의류','건강보조기구판매','건강원',
    '견과류판매','건어물상','건축백화점','곡물소매','골동품판매','관광/민예품/선물용품소매','그릇판매','그림/액자판매','금연관련제품판매','금은방','기념패/휘장','냉동식품판매','노래방기기판매','노점/유사이동판매',
    '녹즙판매','농기구판매','농자재판매','다이어트상품판매','딝집','담배소매업','도료염료','동물약품판매','두유판매','등산용품판매','맞춤양복/양복점','맞춤양장/양장점','목제품판매','무전기(판매/수리)','물물교환센타',
    '미곡상','법복(승복)판매','복권판매','분재판매','비데판매','사료소매','사진/광학/정밀기기소매','상품권판매','생수판매','생식판매','선물용품판매','선식판매','성인용품판매','셔터/새시판매','수석판매','수영용품판매',
    '수입가전제품판매','수입품판매점','수족관','시계방','식용유판매','식자재판매','심야전기보일러판매','십자수/뜨개','안전보호구판매','애견/애완/동물사육판매','애완동물 미용실','양품점','어물상','연탄판매','예복/웨딩드레스',
    '예술품/골동품소매','오디오전문점','오락게임기구/장난감소매','우유판매','유과판매','유니폼/맞춤복/단체복','유류판매','유리/거울판매','유리/페인트/철물건축자재','유아용품/장난감대여판매','육류소매','음반/테이프/CD','인장/도장','자동판매기운영',
    '자전거판매/수리','자울판매','전화기판매','정수기연수기','제과재료판매','조립식앵글판매','종교용품판매-기독교','종교용품판매-불교','종합소매','주방가구판매','중고가전가구','중고명품판매교환','지물판매','진열장판매','청바지판매','총포상',
    '카페트판매','캐릭터상품','퀼트전문','태양열온수기판매','토산품/기념품점','특수복판매','표구점','할인점','향수전문점','혼수전문점','홈패션','화랑');

DELETE FROM UPJONG_CODE WHERE INDSLCLSNM NOT IN ('음식','숙박','수리','개인서비스','자동차부품판매업','도매','소매','예술,여가관련','스포츠,오락관련','교육','사업시설관리','사업지원서비스업','임대업','부동산업','전문서비스업','기타전문,과학,기술서비스업');

/* 업종 대분류명 카피 페이지의 중분류 카테고리로 수정 */
UPDATE UPJONG_CODE SET INDSLCLSNM = "수리" WHERE INDSSCLSNM IN ('자동차정비/카센타','세차장','가구수리','가방구두수선','가전제품수리','개인/가정용품수리-종합','광택전문','농기구수리','악기수선','에어컨수리/설치',
	'열쇠제작','오토바이판매/수리','옷수선','자동차검사소','정보통신기기수리','컴퓨터수리','피아노조율');
    
UPDATE UPJONG_CODE SET INDSLCLSNM = "개인서비스" WHERE INDSSCLSNM IN ('미용실','세탁소/빨래방','비만/피부관리','발/네일케어','요가/단식','욕탕업-종합','안마시술소','예식장/예식서비스','결혼상담소','단전호흡','목욕업-찜질방',
	'사우나/증기탕/온천','세탁대행','쇼파침대카펫트세탁','스포츠마사지','신발세탁','운명감정작명','지압원','체형미교실','폐백전문','휴게텔');

UPDATE UPJONG_CODE SET INDSLCLSNM = "자동차부품판매업" WHERE INDSSCLSNM IN ('타이어판매','자동차부품판매','자동차판매','네비게이션판매','수입자동차판매','자동차유리전문점','자동차장식품판매',
	'중고자동차판매','중고타이어판매','카오디오전문');
    
UPDATE UPJONG_CODE SET INDSLCLSNM = "도매" WHERE INDSSCLSNM IN ('휴대폰튜닝');

UPDATE UPJONG_CODE SET INDSLCLSNM = "소매" WHERE INDSSCLSNM IN ('편의점','수퍼마켓','옷가게','약국','정육점','식료품점','꽃집/꽃배달','청과물소매','화장품판매점','철물/건설자재소매',
	'잡화점','안경업','석유판매업','일반의류','사무/문구용품','수산물소매','아이스크림판매','시계/귀금속','건강식품판매','일반가구소매','철물점','건강/헬스용품','액세서리판매','침구/수예품','컴퓨터판매점',
    '주방용품','서적/신문소매','휴대폰가게','의료용품소매','신발소매','인삼제품판매','보일러/냉난방용품','자전거판매','유아/임부복','공예품판매','낚시용품판매','섬유/직물/주단','일반가전제품','골프용품판매','차량가스충전소',
    '한복/갈옷/민속옷','완구점','재활용/고물수집','가방/가죽제품소매','캐쥬얼/스포츠의류','생활용품판매','악기판매','교복판매','인테리어/욕실용품/커튼','보청기판매','구두제화/캐주얼화','유기농식품판매',
    '스키장비판매','LPG판매','가구판매-돌침대','가구판매-사무용가구','가구판매-수입가구','가구판매-침대전문','가발판매','가스레인지판매','가정용연료소매','가죽/모피의류','건강보조기구판매','건강원',
    '견과류판매','건어물상','건축백화점','곡물소매','골동품판매','관광/민예품/선물용품소매','그릇판매','그림/액자판매','금연관련제품판매','금은방','기념패/휘장','냉동식품판매','노래방기기판매','노점/유사이동판매',
    '녹즙판매','농기구판매','농자재판매','다이어트상품판매','딝집','담배소매업','도료염료','동물약품판매','두유판매','등산용품판매','맞춤양복/양복점','맞춤양장/양장점','목제품판매','무전기(판매/수리)','물물교환센타',
    '미곡상','법복(승복)판매','복권판매','분재판매','비데판매','사료소매','사진/광학/정밀기기소매','상품권판매','생수판매','생식판매','선물용품판매','선식판매','성인용품판매','셔터/새시판매','수석판매','수영용품판매',
    '수입가전제품판매','수입품판매점','수족관','시계방','식용유판매','식자재판매','심야전기보일러판매','십자수/뜨개','안전보호구판매','애견/애완/동물사육판매','애완동물 미용실','양품점','어물상','연탄판매','예복/웨딩드레스',
    '예술품/골동품소매','오디오전문점','오락게임기구/장난감소매','우유판매','유과판매','유니폼/맞춤복/단체복','유류판매','유리/거울판매','유리/페인트/철물건축자재','유아용품/장난감대여판매','육류소매','음반/테이프/CD','인장/도장','자동판매기운영',
    '자전거판매/수리','자울판매','전화기판매','정수기연수기','제과재료판매','조립식앵글판매','종교용품판매-기독교','종교용품판매-불교','종합소매','주방가구판매','중고가전가구','중고명품판매교환','지물판매','진열장판매','청바지판매','총포상',
    '카페트판매','캐릭터상품','퀼트전문','태양열온수기판매','토산품/기념품점','특수복판매','표구점','할인점','향수전문점','혼수전문점','홈패션','화랑');
    
UPDATE UPJONG_CODE SET INDSLCLSNM = "예술,여가관련" WHERE INDSSCLSNM IN ('독서실','연극/음악/예술관련기타','주말농장');

UPDATE UPJONG_CODE SET INDSLCLSNM = "스포츠,오락관련" WHERE INDSSCLSNM IN ('노래방','당구장','헬스클럽','실내골프연습장','실외골프연습장','스포츠센터','볼링장','게이트볼장',
	'게임룸','기원','기타실내운동시설','기타실외운동시설','기타오락관련산업','낚시터','래프팅','롤러스케이트장','무도원','복싱도장','수상스키','수영장','스킨스쿠버강습','스티커사진방','실내낚시','실내수영장','실내야구연습장',
    '실내테니스장','실외궁도장','야구장','오락용사격장','이종격투기','전자오락실','체육관','축구장','인터넷PC방','쿵푸도장','킥복싱','탁구장','택견도장','테니스장','풋살경기장');
    
UPDATE UPJONG_CODE SET INDSLCLSNM = "교육" WHERE INDSSCLSNM IN ('학원-입시','피아노/바이올린/기타','학원-외국어/어학','태권도장','학원-어린이영어','서예/서화/미술','놀이방','어린이집','학원-자동차운전','검도도장',
	'문화센터','블록놀이방','실내놀이터-유아','운동/코치학교','운전연수전문','유도장','유아교육기관기타','유치원','직업전문학교','직업훈련소','컴퓨터학원','학습지보급','학원-가요','학원-간호조무사','학원-검정고시','학원-경영','학원-공예',
    '학원-공인중개사','학원-국악','학원-기타','학원-꽃꽃이','학원-디자인','학원-말더듬','학원-무용','학원-미용','학원-바둑','학원-배우/탤런트','학원-사교춤','학원-서당','학원-속독','학원-스포츠/재즈댄스','학원-심리변론','학원-에어로빅',
    '학원-요리','학원-웅변','학원-제과기술','학원-주산암산부기속셈','학원-중장비','학원-펜글씨/한문','학원-피부미용','학원/국가고시','합기도장');
    
UPDATE UPJONG_CODE SET INDSLCLSNM = "사업시설관리" WHERE INDSSCLSNM IN ('청소/소독');

UPDATE UPJONG_CODE SET INDSLCLSNM = "사업지원서비스업" WHERE INDSSCLSNM IN ('가사도우미알선','고객관리대행','복사업','사무대리서비스','상품전시','상품포장','신용조사/흥신소','심부름센터','이민유학알선','이벤트기획',
	'인력공급/고용알선','전단지배포대행','출장파티/연회대행','탐정/경호');

UPDATE UPJONG_CODE SET INDSLCLSNM = "임대업" WHERE INDSSCLSNM IN ('비디오/오디오테이프대여','가정용가구/기기임대','도서/만화대여','렌트카','사무기기대여','연극공연/영화제작용품임대','오락/스포츠용품대여','의류/한복대여');

UPDATE UPJONG_CODE SET INDSLCLSNM = "부동산업" WHERE INDSSCLSNM IN ('부동산감정평가','부동산중개');

UPDATE UPJONG_CODE SET INDSLCLSNM = "전문서비스업" WHERE INDSSCLSNM IN ('변호사','법무관련서비스-종합','간판제작종합','경영연구소','공인노무사','공인회계사','공증인','관세사','광고물제작','변리사','세무사','속기사무사','손해사정인','인쇄종합',
	'행정서사','회계관련서비스-종합','지도제작');
    
UPDATE UPJONG_CODE SET INDSLCLSNM = "기타전문,과학,기술서비스업" WHERE INDSSCLSNM IN ('사진관','번역/통역서비스','사업중개업','상업사진','연예인대리업','패션디자인');


/* 같이 묶인 대분류를 하나의 키값으로 불러오기 위해서 대분류 코드 통일 */
UPDATE UPJONG_CODE SET INDSLCLSCD = "Q" WHERE INDSLCLSNM IN ('음식','숙박');

UPDATE UPJONG_CODE SET INDSLCLSCD = "F" WHERE INDSLCLSNM IN ('수리','개인서비스');

UPDATE UPJONG_CODE SET INDSLCLSCD = "C" WHERE INDSLCLSNM IN ('자동차부품판매업','도매','소매');

UPDATE UPJONG_CODE SET INDSLCLSCD = "M" WHERE INDSLCLSNM IN ('예술,여가관련','스포츠,오락관련');

UPDATE UPJONG_CODE SET INDSLCLSCD = "R" WHERE INDSLCLSNM IN ('교육');

UPDATE UPJONG_CODE SET INDSLCLSCD = "U" WHERE INDSLCLSNM IN ('사업시설관리','사업지원서비스업','임대업');

UPDATE UPJONG_CODE SET INDSLCLSCD = "L" WHERE INDSLCLSNM IN ('부동산업');

UPDATE UPJONG_CODE SET INDSLCLSCD = "I" WHERE INDSLCLSNM IN ('전문서비스업','기타전문,과학,기술서비스업');